### DataFrame - Criação e Fatiamento

In [1]:
import numpy as np
import pandas as pd

In [2]:
np.random.seed(101)

In [5]:
df = pd.DataFrame(np.random.randn(5, 4), index='A B C D E'.split(), columns='W X Y Z'.split())

In [6]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [7]:
df['W']

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [8]:
type(df['W'])

pandas.core.series.Series

In [9]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df[['W', 'Z']]

          W         Z
A -0.993263  0.000366
B  1.025984  0.649826
C  2.154846 -0.346419
D  0.147027  1.024810
E -0.925874  0.610478

In [12]:
df.W

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [13]:
df['SUM'] = df['X'] + df['Y']

In [14]:
df

          W         X         Y         Z       SUM
A -0.993263  0.196800 -1.136645  0.000366 -0.939845
B  1.025984 -0.156598 -0.031579  0.649826 -0.188177
C  2.154846 -0.610259 -0.755325 -0.346419 -1.365584
D  0.147027 -0.479448  0.558769  1.024810  0.079321
E -0.925874  1.862864 -1.133817  0.610478  0.729047

- método `drop` é usado para deletar uma coluna (`axis=1`) de dataframe. Se o param `inplace=True`, você altera o próprio df sem precisa de reatribuir a uma nova variável.

In [15]:
df.drop('SUM', axis=1, inplace=True)

In [16]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [17]:
df.loc['A']

W   -0.993263
X    0.196800
Y   -1.136645
Z    0.000366
Name: A, dtype: float64

In [18]:
df.loc['A', 'X']

0.19679950499134005

In [19]:
df.loc[['A', 'B'], ['X', 'Y', 'Z']]

          X         Y         Z
A  0.196800 -1.136645  0.000366
B -0.156598 -0.031579  0.649826

In [20]:
df.iloc[1:4, 2:]

          Y         Z
B -0.031579  0.649826
C -0.755325 -0.346419
D  0.558769  1.024810

#### Métodos `loc` e `iloc`:
- método loc faz busca usando os labels como referencia
- método iloc faz a busca usando os índice como ref (1:2, 3:)